app/controllers/directory_trees_controller.rb

  def index
    @directory_trees = DirectoryTree.all
---
SELECT "directory_trees".* FROM "directory_trees"

  def create
    @directory_tree = DirectoryTree.new(directory_tree_params)

    if @directory_tree.save
---
INSERT INTO "directory_trees" ("name", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["name", "New test dir"], ["created_at", "2018-04-24 01:39:53.865456"], ["updated_at", "2018-04-24 01:39:53.865456"]]

  def update
    if @directory_tree.update(directory_tree_params)
---
UPDATE "directory_trees" SET "name" = ?, "updated_at" = ? WHERE "directory_trees"."id" = ?  [["name", "First Tree"], ["updated_at", "2018-04-24 00:38:30.893210"], ["id", 1]]

  def destroy
    @directory_tree.destroy
---
DELETE FROM "directory_trees" WHERE "directory_trees"."id" = ?  [["id", 2]]

  def set_directory_tree
    @directory_tree = DirectoryTree.find(params[:id])
---
SELECT  "directory_trees".* FROM "directory_trees" WHERE "directory_trees"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]