app/controllers/nodes_controller.rb

SELECT  "directory_trees".* FROM "directory_trees" WHERE "directory_trees"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
INSERT INTO "nodes" ("name", "parent_id", "directory_tree_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["name", "2"], ["parent_id", 1], ["directory_tree_id", 1], ["created_at", "2018-04-24 01:40:10.627263"], ["updated_at", "2018-04-24 01:40:10.627263"]]
---
  def create
    @directory_tree = DirectoryTree.find(params[:directory_tree_id])
    @node = @directory_tree.nodes.build(node_params)

    @node.save